/*
{
  "colors": [
    {
      "name": "Burnt Sienna",
      "value": "#ED6161"
    },
    {
      "name": "Razzmatazz",
      "value": "#EF0B58"
    },
    {
      "name": "Trinidad",
      "value": "#EF560B"
    },
    {
      "name": "Harlequin",
      "value": "#2BEF0B"
    },
    {
      "name": "Zombie"
    },
    {
      "name": "Chartreuse",
      "value": "#7FEF0B"
    },
    {
      "name": "Malachite",
      "value": "#0BEF6E"
    },
    {
      "name": "Azure Radiance",
      "value": "#0B76EF"
    },
    {
      "name": "Bright Turquoise",
      "value": "#0BC9EF"
    },
    {
      "name": "Edgewater"
    },
    {
      "name": "Dodger Blue",
      "value": "#5249FD"
    },
    {
      "name": "Pink Flamingo",
      "value": "#FD49EE"
    },
    {
      "name": "Shocking"
    },
    {
      "name": "Golden Fizz",
      "value": "#EBFD49"
    },
    {
      "name": "Aquamarine",
      "value": "#49FDF0"
    }
  ]
}
 */

/*
Обратите внимание, что наши дизайнеры всё еще работают над цветами и не всем именам цветов соответствует значение
— эти цвета не стоит выводить в качестве доступных пользователям.

Общие компоненты экрана
- Аппбар с названием приложения: "Эксклюзивная палитра Colored Box".

- Сетка с доступными цветами. Ширина сетки — 3 ячейки. На каждой ячейке снизу напись с названием цвета на полупрозрачном фоне.

- По нажатию на ячейку открывается экран следующей компоновки: крупно название цвета, контейнер с цветом, поле со значением цвета
  в формате hex и три поля со значением компонент `Red`, `Green` и `Blue`.

- При долгом нажатии на ячейку сетки копировать в системный буфер обмена hex-значение цвета.

- На детальном экране при нажатии на каждое из полей копировать его значение в системный буфер обмена.
  Библиотеку для работы с буфером обмена выберите самостоятельно. Если возникнут проблемы с выбором или вопросы, обращайтесь в чат к нашим менторам.

Состояние загрузки
В процессе загрузки / обработки входных данных, должен отображаться экран с индикатором прогресса.

Архитектура
Попробуйте самостоятельно выбрать архитектурное решение для этого задания.
В последующих заданиях каждый подход будет разбираться подробнее, но сейчас мы хотим, чтобы вы набили свои шишки :)
 */